## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * google_container_cluster.trusted_workload
* Replace
  * google_container_node_pool.components_pool



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_container_cluster.trusted_workload will be updated in-place
  ~ resource "google_container_cluster" "trusted_workload" {
        id                          = "projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow"
        name                        = "trusted-workload-kyma-prow"
        # (27 unchanged attributes hidden)

      ~ cluster_autoscaling {
          ~ autoscaling_profile = "BALANCED" -> "OPTIMIZE_UTILIZATION"
            # (1 unchanged attribute hidden)
        }

        # (22 unchanged blocks hidden)
    }

  # google_container_node_pool.components_pool must be replaced
-/+ resource "google_container_node_pool" "components_pool" {
      ~ id                          = "projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow/nodePools/components-pool" -> (known after apply)
      ~ initial_node_count          = 0 -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-a/instanceGroupManagers/gke-trusted-workload--components-pool-5f423fdc-grp",
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-c/instanceGroupManagers/gke-trusted-workload--components-pool-13c0e5b0-grp",
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-b/instanceGroupManagers/gke-trusted-workload--components-pool-e7895f9f-grp",
        ] -> (known after apply)
      ~ location                    = "europe-west4" -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-a/instanceGroups/gke-trusted-workload--components-pool-5f423fdc-grp",
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-c/instanceGroups/gke-trusted-workload--components-pool-13c0e5b0-grp",
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-b/instanceGroups/gke-trusted-workload--components-pool-e7895f9f-grp",
        ] -> (known after apply)
      + max_pods_per_node           = (known after apply)
        name                        = "components-pool"
      + name_prefix                 = (known after apply)
      ~ node_count                  = 0 -> (known after apply)
      ~ node_locations              = [
          - "europe-west4-a",
          - "europe-west4-b",
          - "europe-west4-c",
        ] -> (known after apply)
      + operation                   = (known after apply)
      ~ project                     = "sap-kyma-prow" -> (known after apply)
      ~ version                     = "1.26.5-gke.1200" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ autoscaling {
          - total_max_node_count = 0 -> null
          - total_min_node_count = 0 -> null
            # (3 unchanged attributes hidden)
        }

      ~ network_config {
          ~ create_pod_range     = false -> (known after apply)
          ~ enable_private_nodes = false -> (known after apply)
          + pod_ipv4_cidr_block  = (known after apply)
          + pod_range            = (known after apply)

          + pod_cidr_overprovision_config {
              + disabled = (known after apply)
            }
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ disk_type         = "pd-balanced" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          + min_cpu_platform  = (known after apply)
          ~ oauth_scopes      = [
              - "https://www.googleapis.com/auth/devstorage.read_only",
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
              - "https://www.googleapis.com/auth/service.management.readonly",
              - "https://www.googleapis.com/auth/servicecontrol",
              - "https://www.googleapis.com/auth/trace.append",
            ] -> (known after apply)
          - resource_labels   = {} -> null
          ~ service_account   = "default" -> (known after apply)
          - tags              = [] -> null
          ~ taint             = [
              ~ {
                  ~ effect = "NO_SCHEDULE" -> "PREFER_NO_SCHEDULE"
                    # (2 unchanged elements hidden)
                },
            ]
            # (6 unchanged attributes hidden)

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

            # (1 unchanged block hidden)
        }

      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
          ~ strategy        = "SURGE" -> (known after apply)

          + blue_green_settings {
              + node_pool_soak_duration = (known after apply)

              + standard_rollout_policy {
                  + batch_node_count    = (known after apply)
                  + batch_percentage    = (known after apply)
                  + batch_soak_duration = (known after apply)
                }
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>





## :warning: Warnings :warning:

```hcl
Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with kubernetes_service_account.trusted_workload_terraform_executor,
  on terraform-executor.tf line 42, in resource "kubernetes_service_account" "trusted_workload_terraform_executor":
  42: resource "kubernetes_service_account" "trusted_workload_terraform_executor" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and one more similar warning elsewhere)

```






<!-- github-comment: {"Command":"plan","PRNumber":8245,"Program":"tfcmt","SHA1":"fde10a3acf488beec970bc28ff2026392e2b6989","Vars":{}} -->